/*------------------------------------------------
  第6回
  0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1, ...
  と一秒ごとに数字を表示するプログラムを作ってください。
  -------------------------------------------------*/
//配列ver
int i, n;
//配列で7セグのレイアウトを定義　
//boolean:真(true:1)偽(false:0)
boolean Num_Array[10][7] = {
  {1, 1, 1, 1, 1, 1, 0}, //0
  {0, 1, 1, 0, 0, 0, 0}, //1
  {1, 1, 0, 1, 1, 0, 1}, //2
  {1, 1, 1, 1, 0, 0, 1}, //3
  {0, 1, 1, 0, 0, 1, 1}, //4
  {1, 0, 1, 1, 0, 1, 1}, //5
  {1, 0, 1, 1, 1, 1, 1}, //6
  {1, 1, 1, 0, 0, 1, 0}, //7
  {1, 1, 1, 1, 1, 1, 1}, //8
  {1, 1, 1, 1, 0, 1, 1} //9
};

void setup() {
  pinMode(0, OUTPUT);
  pinMode(1, OUTPUT);
  pinMode(2, OUTPUT);
  pinMode(3, OUTPUT);
  pinMode(4, OUTPUT);
  pinMode(5, OUTPUT);
  pinMode(6, OUTPUT);
}

void loop() {
  for (i = 0; i <= 9; i++) {
    for (n = 0; n <= 7; n++) {
      //n:ピン番号　
      //(Num_Array[i][n])が1の時Trueで点灯
      //(Num_Array[i][n])が0の時Falseで消灯
      digitalWrite(n, Num_Array[i][n]);
    }
    delay(1000);
  }

}
