#include<stdio.h>
int main(void){
  int aa[3][4]={{1,2,3,4},{5,6,7,8},{9,10,11,12}};    //縦(行数)3,横(列数)4の箱のイメージ
  int bb[][4]={{1,2,3,4},{5,6,7,8},{9,10,11,12}};     //[]の行数は省略可能,横の列数は省略不可
  int i,j,k,l;
  for(i=0;i<3;i++){               //縦(行数)は三行あるが0行目、1行目、2行目と数える
    for(j=0;j<4;j++){             //横(列数)も同様に0列、1列、2列、3列の4列
      printf("%d ",aa[i][j]);
    }
    printf("\n");
  }
  for(k=0;k<3;k++){
    for(l=0;l<4;l++){
      printf("%3d  ",bb[k][l]);
    }
    printf("\n");
  }
  return 0;
}
/*
課題work7
program7と同様に3行4列のint型の配列を入力し表を出力し、行ごとの合計と列ごとの合計を計算し
全体の合計も出力しなさい。
表の例：   1   2   3   4  : 10 
           5   6   7   8  : 26
           9  10  11  12  : 42
          -------------------
          15  18  21  24  : 78
*/